package com.example.lesktllifecycle

class BodyMassIndex {
    val textOne =
        "НИЗКИЙ ИМТ\nРекомендуется:\nувеличение калорийности потребляемых продуктов: введение в рацион большего количества жирного мяса, мясных бульонов, кисломолочных продуктов (сметаны, сливок, молока), хлебобулочных изделий и продуктов с большим количеством углеводов;\n" +
                "соблюдение баланса: увеличение калорийности пищи не исключает из рациона овощи и фрукты как основной источник витаминов;\n" +
                "возможное сокращение объема порций при увеличении количества приемов пищи (до 4-5 раз в день). При этом процесс приема пищи должен проходить в спокойной обстановке (исключаются быстрые перекусы).\n"
    val textTwo = "НОРМАЛЬНЫЙ ИМТ\nУ вас Нормальная масса тела. "
    val textTree =
        "ПРЕДОЖИРЕНИЕ\nРекомендуется:\nРациональное питание с дефицитом калорий и умеренные физические нагрузки. Для правильного похудения необходимо потреблять меньше калорий, чем организм расходует в течение дня. Рекомендовано питаться небольшими порциями 5-6 раз в день, " +
                "последний прием пищи должен завершиться за 2-3 часа до сна. В сутки необходимо потреблять не менее 1,5 литров негазированной воды. Исключают консервированные продукты, фастфуд, алкоголь, жареные и копченые блюда. Рекомендовано добавить в рацион нежирные сорта " +
                "мяса и рыбы, изделия из твердых сортов пшеницы, низкокалорийные кисломолочные продукты, свежие овощи. Фрукты и легкоусвояемые углеводы желательно употреблять до 15 часов. Наиболее калорийный прием пищи должен приходиться на завтрак, ужин должен состоять из овощей," +
                " нежирного мяса либо кисломолочных продуктов."
    val textFour =
        "ОЖИРЕНИЕ\nРекомендации:\nПотребление малокалорийной, но значительной по объему пищи: сырые овощи и фрукты. Снижение калорийности рациона на 40 % от нормальной потребности.\n" +
                "Ограничение в рационе быстрорастворимых и быстро-всасывающихся углеводов, так как они в организме легко превращаются в жир. Запрет распространяется на конфеты, шоколад, кондитерские изделия, мороженое и т. д.\n" +
                "Растительные жиры должны составлять 50 % (это примерно по 30–35 г) от общего количества потребляемых жиров. Ограничить продукты, богатые холестерином (икра, внутренние органы животных).\n" +
                "Питание должно быть дробным – 5-6-разовым, причем основное потребление калорий должно приходиться на утро и день. Исключить из рациона продукты и блюда, возбуждающие аппетит (алкоголь, горчица, хрен, перец; острые, соленые, копченые и пряные блюда и закуски и т. п.).\n" +
                "Ограничение потребления соли (до 5 г) и жидкости (до 1–1,5 л) в сутки. Это заставляет организм расщеплять жир и превращать его в воду.\n" +
                "Введение разгрузочных дней (яблочных, арбузных, молочных, кефирных, огуречных и других).\n" +
                "Не принимать большое количество пищи после 18 часов (можно съесть легкий салат с цельнозерновым хлебом, выпить натуральный сок с мякотью, на ночь выпить стакан теплого молока или обезжиренного кефира).\n" +
                "Периодически (при отсутствии противопоказаний) применять лечебное голодание (1–3 раза в месяц)."
    val textFive = "ВЫСОКАЯ СТЕПЕНЬ ОЖИРЕНИЯ\nОБЩИЕ РЕКОМЕНДАЦИИ\n" +
            "•    Цель  - снижение ИМТ ниже 30 кг / м2. На начальном этапе, при 2 и 3 степени ожирения– снижение массы тела на 10%  от исходной.  \n" +
            "•    Общий калораж должен быть снижен под контролем врача при ожирении 1степени на 300- 500 ккал, ожирении 2-3 степени – на 500 - 1000 ккал.\n" +
            "•    Консультация врача – эндокринолога\n" +
            "•    Дробное питание (5—6 раз в сутки) небольшими порциями (объем не более 200 мл) с обязательным включением в рацион салатов из овощей и фруктов, богатых растительными во¬локнами и уменьшением, вплоть до полного отказа, сахара, сладостей, выпечки.\n" +
            "•    Еженедельное проведение 1-2 разгрузочных дней.  \n" +
            "•    Уменьшение, вплоть до полного отказа, употребления насыщенных жирных кислот (животные жиры, сливочное масло, сливки, яйца), которые способствуют повышению уровня холестерина.\n" +
            "•    Увеличение  употребления продуктов, обогащенных полиненасыщенными жирными кислотами (жидкие растительные масла, рыба, птица, морские продукты), способствующих снижению уровня липидов в крови.\n" +
            "•    Увеличение употребления клетчатки и сложных углеводов (овощи, фрукты, каши) - в день не менее 350 г.\n" +
            "•    Ограничение количества поваренной соли в пище (до 3-5 г/сут).\n" +
            "•    Исключение алкоголя.\n" +
            "•    Употребление не менее 1,5 л. воды в сутки.\n" +
            "•    Оптимальный темп снижения массы тела   0,5—1,0 кг в неделю и не более.\n" +
            "•    Регулярные динамические нагрузки, не менее 30 минут ходьбы умеренным темпом ежедневно."

    fun checkMass(weight: Double, height: Double): Double {
        return (weight / ((height / 100.0) * (height / 100.0)))
    }

}